#### ModelPathUtils Members

---

|  |
| --- |
| ModelPathUtils Class   Methods   Properties   See Also |

The  ModelPathUtils  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | ConvertCloudGUIDsToCloudPath | Converts a pair of cloud project and model GUIDs to a valid cloud path. |
| Public method Static member | ConvertModelPathToUserVisiblePath | Gets a string version of the path of a given ModelPath. |
| Public method Static member | ConvertUserVisiblePathToModelPath | Converts a user-visible path (string) to a ModelPath. |
| Public method Static member | IsValidUserVisibleFullServerPath | Determines whether the given string represents a valid server path. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | CloudRegionEMEA | The name of cloud region EMEA. |
| Public property Static member | CloudRegionUS | The name of cloud region US. |

# See Also

ModelPathUtils Class

Autodesk.Revit.DB Namespace